x + y    Сложение

x - y    Вычитание

x * y    Умножение

x / y    Деление

x // y    Получение целой части от деления

x % y    Остаток от деления

-x    Смена знака числа

abs(x)    Модуль числа

divmod(x, y)    Пара (x // y, x % y)

x ** y    Возведение в степень

pow(x, y[, z])    xy по модулю (если модуль задан)

boolean - логическое значение True или False

int - представляет целое число, например, 1, 4, 8, 50.

float - представляет число с плавающей точкой, например, 1.2 или 34.76

complex - комплексные числа

str - строки, например "hello, Maker's". В Python 3.x строки представляют набор символов в кодировке Unicode

bytes - последовательность чисел в диапазоне 0-255

byte array - массив байтов, аналогичен bytes с тем отличием, что может изменяться

list - список

tuple - кортеж

set - неупорядоченная коллекция уникальных объектов

frozen set - то же самое, что и set, только не может изменяться (immutable)

dict - словарь, где каждый элемент имеет ключ и значение





 

